let handler = async (m, { command, text }) => m.reply(`*『𝑪𝒐𝒍𝒅≼🔮≽𝑵𝒊𝒈𝒉𝒕』*
* ╮─═══─ • ❯🔮❮ • ─═══─╭*
*✿︎ּبــڛــمــﷲ ּﷻ ۖ ڕحــمــان اڶــڕحــۑْــم ۗ*
 *☆مــنــوريــن🤍*
*〖اســتــمــارة الــدخــول 〗*
*☽︎↫ امــلأ الاســتــمــارة لــلــدخــول ↬↬*
*❖ــــــــــــــــــ☬ـــــــــــــــــــ❖*
*☆الــشــخــصــيــة🌧️〖 〗*
*✩الانــمــي❄️〖 〗* 
*☆صــورة لــلــشــخــصــيــة☃️〖 〗*
*✩ولــد/بــنــت👥 〖 〗*
*☆ مــن طــرف 🌒〖 〗*
*┗═───═⊱⬩⊰🔮⊱⬩⊰═───═┛*
*『┋مــــلاحـــظـــات「🫧」┋』*
*1┋مــمـنــوع البــنـت تــاخــذ لــقـب ولــد و نـفـس الشــي لـلــولـد*
*2┋اخـتـيــار الـلـقـب يـكــون من*
*「انـــــمـــي」*
*「مـــانــــقـــــا」*
*「مـــــانــــهــــــو」*
*3┋مـمـنــوع الـارقــام الـوهـمـيــة*
*4┋صـنــم-تـبـي تـخـش وتـخـرج اطــلـع مـن هـنــا مــا نــحـتـاجــك*
*╮─═══─ • ❯🔮❮ • ─═══─╭*
*❀نــتــمــنــي مــنــك الــتــواجــد والــمــشــاركــة  واحــتــرام الــقــواعــد🤍*

 *✾تــ✍︎ــوقــيــع ↯:*
*⇦〖 𝑪𝒐𝒍𝒅:⟨🔮⟩𝑵𝒊𝒈𝒉𝒕 〗*
*┗═───═⊱⬩⊰🔮⊱⬩⊰═───═┛*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|الاستمارة|استماره|استمارة)$/i

export default handler


