let handler = m => m 
 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat] 
  
 if (/^اعلان ديث نوت$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*══━━━━🔮◈🔮━━━━══*

•📓┇فـعـالـيـة ديـث نـوت┇📓•*

*══━━━━🔮◈🔮━━━━══*

*❆ الـشـرح : 👨🏻‍🏫*

*❅ تـطـرح أسـئـلـة عـاديـة (صـور ،  كـتـابـة..*

*❅ مـن يـحـصـل عـلـى نـقـطـة يـقـصـي احـد الـمـشتاركـيـن*

*❅ مـن يـبـقـى أخـيـرا هـو الـفـائـز*

*❅ كـل مـا تـقـتـل أحـد يـضـاف لـك 5k*

*══━━━━🔮◈🔮━━━━══*

*❆ الـمـقـدم 🕵🏻‍♂️ : ┇┇*
*❆ عـدد الـمـشـاركـيـن 🔢 : ┇┇*

*══━━━━🔮◈🔮━━━━══*
*✾تــ✍︎ــوقــيــع ↯:*
*『𝑪𝒐𝒍𝒅≼🔮≽𝑵𝒊𝒈𝒉𝒕』*
 `, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 }

   if (/^لعب ديث نوت$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*⌝ فعالية الديث نوت╎ 📓⌞*
*══━━━━🔮◈🔮━━━━══*

*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*
*✠ لقب┃📓┃ الضحايا┃0┃*

*══━━━━🔮◈🔮━━━━══*
 `, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 }

   if (/^نتائج ديث نوت$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `*══━━━━🔮◈🔮━━━━══*

*•📓┇نـتـائـج فـعـالـيـة الـديـث نـوت┇📓•*

*══━━━━🔮◈🔮━━━━══*
*❆ الــفــائــز 🏆 : ┇ ┇*
*❅ الـجـائـزة 🪙 : ┇40k┇*

*══━━━━🔮◈🔮━━━━══*
*❆ بـاقــي الـمـشـاركـيـن 🏅*
*❅ ┇ ┇*
*❅ ┇ ┇*
*❅ ┇ ┇*
*❅ ┇ ┇*
*❅ ┇ ┇*
*❅ ┇ ┇*
*❅ ┇ ┇*

*❆ الـجـائـزة 🪙 : ┇20k┇*
*══━━━━🔮◈🔮━━━━══*

*❆ الـمـقـدم 🕵🏻‍♂️ : ┇ ┇*
*❅ الـجـائـزة 🪙 : ┇60k┇*

*══━━━━🔮◈🔮━━━━══*
*✾تــ✍︎ــوقــيــع ↯:*
*『𝑪𝒐𝒍𝒅≼🔮≽𝑵𝒊𝒈𝒉𝒕』*
 `, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 }

 return !0 } 
 export default handler