let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^الكيورا بحبك|الكيورا عاوزه اتجوزك|بحبك|بموت فيك|نتجوز|الكيورا هنتجوز امتي|الكيورا انت ليا|الكيورا بموت فيك$/i.test(m.text)) { 
     responses = [ 
       'شكرا  ',  
       'هفكر في الموضوع',  
             'و انا',  
                   'استحيت',  
                         'خلاص لا اتكسف ',  
                               'اسكتتتتت عشان مضربكش عيب الكلام ده   ',  
                                     'طيب و بعدين '  
     ]; 
} else if (/^السلام عليكم|سلام عليكم ورحمه الله وبركاته|سلام عليكم|السلام عليكم ورحمه الله وبركاته$/i.test(m.text)) { 
     responses = [ 
       'وعليكم السلام',  
          'وعليكم السلام حبي منور',  
              ' وعليكم السلام كيفك',  
                   'وعليكم السلام ورحمة الله وبركاته' 
     ]; 
   }else if (/^ الكيورا عامل ايه|عامله ايه|عاملين ايه|الدنيا عامله ايه|عاملين ايه يشبب$/i.test(m.text)) { 
     responses = [ 
       'كل شيء بخير الحمد لله ',  
          ' مش عارف  ',  
              ' الحمد لله ماشي الحال ',  
                  'الحمد الله',  
                      ' لو انت كويس انا كويس' 
     ]; 
   }else if (/^كول خرا|عرص|متناك|كسمك$/i.test(m.text)) { 
     responses = [ 
       'عيب',  
          ' اتأدب ',  
              ' يا قليل الادب ',  
                  'الله يهديك ',  
                   ' عيب يا طفل' 
     ]; 
 }else if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
     responses = [ 
       ' عاشت ايدك ✨💜',  
           'تسلم ايدك ✨💜 ',  
                'عاش ✨💜 ',  
                  'عاش الكيورا ✨💜',  
                   'اوكي ✨💜' 
     ]; 
   }else if (/^لول|هههه|ههههه|هههههه|ههههههه|هههههههه|😂😂😂$/i.test(m.text)) { 
     responses = [ 
       'دوم دي ضحكة ',  
            ' ضحكني معاك',  
                   'دوم يا رب  ',  
                         'ههه ',  
                         '😂😂😂',  
                         'ايه ال بيضحك',  
                         'اضحك معاك؟',  
                             'دوم ' 
   ]; 
   }else if (/^الكيورا|الكيورا عمك|يا الكيورا$/i.test(m.text)) { 
     responses = [ 
       'قلب الكيورا من جوا✨🥺♥',  
          'اسطوورتي✨🤺 ',  
              ' حبيبي✨🥺♥',  
                  'اخوياااا الطرش✨🥺♥ ',  
                   'اخويا اللي مفيش منه اتنين في البلد دي' 
]; 
   }else if (/^بوت|يا بوت|البوت|بوووت|بووووت|بوووووت|بووووووووت$/i.test(m.text)) { 
     responses = [ 
       '*اسمي الكيورا يروحي✨♥*',  
          '*اسمي الكيورا يعمري✨♥*',  
              '*اسمي الكيورا يحبي✨♥*',  
                  '*اسمي الكيورا يحياتي✨💜* ',  
                   '*اسمي الكيورا يقلبي✨💜*' 
  ];  
  }else if (/^الكيورا حكمه|حكمه|الكيورا حكمة|حكمة$/i.test(m.text)) { 
     responses = [ 
       '*لما السيجارة انطفت الصحابة اختفت ❤️‍🩹🚬*',  
          '*كنت عصفور كلونى عملت اسد صاحبونى 🦁👑*',  
              '*يابنات كفاية اشتغالات 🥱*',  
                  '*الكبير اللي مايقدرش سنو يستاهل ان يتقل منو 😌💞*',  
                   '*احنا صغيرين بس معلمين 🔞😎*',
                     '*دايخ في عالم بايخ 😪*',
                      '*اخرة الشقاوة عيش وحلاوة 😂💞*',
                       '*الله يحميكي من الميكانيكي 🔧*',
                        '*الحلوة من اليابان صاحبها راجل غلبان.. النزاهة بتاعتنا بس الظروف منعتنا 🤍😪*',
                         '*صاحب صاحبك علي عيبه و متصاحبش الي في جيبه 🐶*',
                          '*اتنين ملهمش امان الفرامل والنسوان 🦉*',
                           '*الحب خسارة في الناس الغدارة 🐕‍🦺*',
                            '*البطة المرتاحة للسفر والسياحة 🦆✨*',
                             '*أحب في الدنيا ثلاث.. أمي  ماما  الوالدة 💖🥰*',
                              '*تحياتي لمن دمر حياتي 🥷*',
                               '*عشقت السفر من غدر البشر 🤤💔*',
                                '*رضا الوالدين أهم من أبوك وأمك 🔒*',
                                 '*الرجولة مواقف والندالة دروس 🖇🕯*',
                                  '*على قد حالي وعيون الناس مش سايباني 💔👀*',
                                   '*اتنين ملهمش امان الصاحب والزمان 👐📅*',
                                     '*يارب البنات تخش الجيش 🤲*',
                                      '*الطبيب لما يتدلع الصيدلي يولع 😂🔥*',
                                       '*نحن نختلف عن الاخرون خالص ✨😂*',
                                        '*اللهم أعطهم ضعف ما تمنوه لي ☺️🤲*',
                                          '*يارب احفظ مصر والموتوسيكل 🤲🏍*',
                                           '*جرحك نساني ملامحك 💔😢*'
  ]; 
   }else if (/^صباح النور|صباح النعناع الاخصر|صباح الفل|صباح|صباح الخير $/i.test(m.text)) { 
     responses = [ 
       'صباح الفل ✨💜',  
          'صباح النور ✨💜 ',  
              ' صباح الكاريزما ✨💜',  
                  'انت صحيت وانا رايح انام 🐦👋🏻 ',  
                   'روح نام تاني بقي 🙃' 
     ]; 
   }else if (/^شكرا|تسلم|تسلمي$/i.test(m.text)) { 
     responses = [ 
       'العفو✨🥺♥',  
          ' ولا يهمك مفيش حاجه✨💫 ',  
              ' الشكر لله ✨💜',  
                   'العفو يبشه ✨💜' 
]; 
   }else if (/^🧡|💚|💞|💖|💜|💛|🤍 $/i.test(m.text)) { 
     responses = [ 
       'شكرا✨♥',  
          'تسلم✨♥',  
              '✨♥',  
                  'حبيبي✨💜',  
                   '✨💜' 
  ]; 
     }else if (/^كل ده نور|الجروب نور كده ليه|ايه النور ده|منورين الجدد|منورين|منور $/i.test(m.text)) { 
     responses = [ 
       'نوري انا✨♥',  
          'الجروب نور فعلا✨♥',  
              '✨♥',  
                  'الجروب منور✨💜',  
                   '✨💜' 
  ]; 
   }else if (/^اسكت|اسكت|هتسكت امتي|يا ابني اسكت$/i.test(m.text)) { 
     responses = [ 
             'ملكش دعوه ', 
              ' لع وانت مالك',  
                 ' مش بمزاجك',  
                 'لا مين انت ال هتسكتني ',  
                   'اسكت انت' 
     ]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;