
let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*┌────「✨  𝕌𝕝𝕢𝕦𝕚𝕠𝕣𝕣𝕒  ✨ 」─*\n*“${pickRandom(global.verdad)}”*\n*└────「 ✨  𝔹𝕆𝕋  ✨ 」─*`, m)
}
handler.help = ['verdad']
handler.tags = ['fun']
handler.command = /^لو/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

global.verdad = [
"لو خيروك انمي ينحذف من ذاكرتك و تشاهده من جديد ماذا ستختار؟ ون بيس ام ناروتو ام هنتر؟",
"لو خيروك تعيش في انمي رومانسي مدرسي او العيش في انمي قدرات خارقة و دموية و اكشن؟",  
 "لو خيروك اصدقاء في الانمي يصبحون اعداء فمن ستختار , كيلو و غون ام ايرين و ارمين ام ناروتو و ساسكي؟", 
 "لو خيروك تصبح من عشيرة الاوزوماكي ام الاوتشيها؟",  
 "لو خيروك بطل انمي يموت من ستختار, لوفي ام ناروتو او سون غوكو؟",  
 "لو خيروك شخصيه انمي تعود للحياه من ستختار, لولوش ام ال ام رولو؟", 
 "لو خيروك تبقي مع طاقم لوفي ام مع عصابة مايكي؟",  
 "لو خيروك انميات كوميدية ام انميات درامية؟",  
 "لو خيروك انمي يحذف الي الابد من ستختار, بليتش ام ون بنش مان ام الخيميائي الفولاذي؟",  
 "لو خيروك شخصية شريرة تصبح طيبه من ستختار, مادارا ام ميرويم ام ايزن؟",  
 "لو خيروك يدربك كاكاشي ام يدربك جيرايا؟",  
 "لو خيروك شخصية تعود للحياه فمن ستختار, ايتاشي ام باجي؟",  
 "لو خيروك تخلي استا امبراطور السحر ام يكون يونو امبراطور السحر؟",  
 "لو خيروك تكون نينجا ام تكون قرصان؟",  
 "لو خيروك شخصية تعود للحياه فمن ستختار, رينغوكو ام ايس؟",  
 "لو خيروك شخصية تعود للحياه فمن ستختار, ايروين ام ساشا؟",  
 "لو خيروك بين الانمي ام المانغا؟",  
 "ثانيه من وقتك للصلاة علي اشرف النبيين و المرسلين ✨",  
 "لو خيروك تعيش مع ليفاي او ناروتو؟",  
 "لو خيروك تكون غول ام تكون عملاق؟",  
 "لو خيروك بين ياتو و كانيكي؟",  
 "لو خيروك بين هانما ام تشيفيو؟", 
 "لو خيروك بين ايساغي ام باتشيرا؟",  
 "لو خيروك بين بارو ام كونيغامي؟",  
 "لو خيروك تقتل ناروتو ام لوفي؟",  
 "لو خيروك بين ابشع طريقة موت, ساشا ام هانجي؟",  
 "ايـــريــــن عـــمــك", 
 "لو خيروك بين ايس و لوفي؟" , 
 "لو خيروك انمي لا ينتهي عرضة ابدا من ستختار, اتاك ام ديث نوت ام دراغون بول؟" , 
 "لو خيروك بين سانجي و اوسوب؟" , 
 "لو خيروك بين لايت و ال ماذا ستختار؟" , 
 "لو خيروك بين الانميات الشونين ام الرومانسيه؟" , 
 "✨ اللهم صلي علي محمد ✨" , 
 "لو خيروك بين انمي ون بيس و انمي ناروتو؟" , 
 "لو خيروك بين انمي بليتش و انمي مونستر؟" , 
 "لو خيروك شرير يموت الي الابد ولا يعود من ستختار؟ غوكو بلاك ام كايدو ام زيريف؟" , 
 "لو خيروك شخصية انمي تموت من ستختار, اوسوب ام سانجي؟" , 
 "لو خيروك بين رسم انمي ون بيس القديم ام رسم انمي ون بيس الحديث؟" , 
 "لو خيروك بين بطل انمي يخرج الي الحقيقه ناروتو ام لايت ام ايرين؟" , 
 "لو خيروك بين ايرين و ايروين؟" , 
 "اذكر الله" , 
  "لو خيروك بين انتهاء انمي ون بيس ام عدم انتهائه؟"
 ] 
