let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*┌────「 سؤال 」─*\n*“${pickRandom(global.bucin)}”*\n*└────「 𝕌𝕝𝕢𝕦𝕚𝕠𝕣𝕣𝕒 」─*`, m)
}
handler.help = ['reto']
handler.tags = ['fun']
handler.command = /سؤال/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.bucin = [ 
 "من هو ثاني اقدم قائد في الغوتي بعد القائد الاعلي ياماموتو؟", 
 "لماذا لم يستطيع غيردلس اكمال مهمه 100 عام؟", 
 "ما كان السبب الرئيسي لقدوم فيجيتا و نابا الي الارض لأول مرة؟", 
 "ما هود الوعد الذي كان بين زورو و كوين؟", 
 "ماذا كان اسم أوبيتو عندما كان عضوا خفيا في الأكاتسكي؟", 
 "من هو العضو العاشر لمنظمة الأكاتسكي ؟", 
 "ما اسم الحجر الذي يؤدي الى الكنز ؟", 
 "ما اسم اليد اليمني لملك القراصنة؟",  
 "ما اسم والدة آيس ؟",  
 "ما اسم مطعم زيف ؟", 
 "ماهو اسم حآرس امبل دآون ؟",   
 "اي عائلة ينتمي اليها كيلو؟",  
 "كم عدد الاسبادا انمى بليتش ؟",  
 "أين ظهر دراغون أول مرة؟",  
 "ما هو اسم غوكو الحقيقي؟",  
 "من هو الهومنكلوس الأول التي تم صنعه؟", 
  "ما هوا أسم اخت لايت (كيرا)؟", 
  "ما هوا أسم عائلة ميناتو؟",  
 "من أول عملاق ظهر في هجوم العمالقة؟",  
 "من هوا نائب اليونكو شانكس؟",  
 "كم يبلغ عمر ليوريو؟", 
  "كم كان عمر تانجيرو في بداية الأنمي؟", 
  "مااسم الحقيقي لمستر 5 منظمة كروكودايل؟", 
  "ما اسم قبيلة كاغورا؟", 
  "من هو ابو لوفي؟",  
  "من هي ام لوفي؟", 
  "هل كورابيكا بنت أم ولد ؟",  
 "ماذا تعني كلمة ناروتو ؟",  
 "ماإسم الأعين التي يمتلكها باين أو ناغاتو؟", 
  "ماذا يستعمل الاسبادا رقم 1 في القتال ؟", 
  "من الذي كان يتنكر احيانا بهيئة كودو شينتشي؟",  
 "ما اسم بطل ديث نوت؟",  
 "هل اعجبك البوت؟",  
 "كم تقييمك للبوت؟", 
  "تراكس يتحد مع من دراغون بول؟", 
  "اول عدو لجهان من ؟", 
  "انمي فيه بنتوتة خجولة وحلوة وشعرها قصير ولونه كحلي زي كذا ولون عينها ابيض وهي نينجا؟", 
  "ولد كان شاب ومجرمين حوله طفل صغير وهو محقق ذكي وبفضله ابو خطيبته سار محقق مشهور؟",  
  "ما إسم الجسر الذي تمت عليه مهمة فريق كاكاشي الجديد؟",
  "مااسم السيف الذي اخذه زورو من ثليلر بارك؟",  
  "مااسم جزيرة روبين التي تدمرت؟", 
 "في جميع سلاسل دراغون بول، كم مرة مات غوكو؟",  
  "شخصية لُقبت بملك الشينوبي، من هي؟", 
  "استيقظ سينكو بعد التحجر ب...", 
 
 "في حرب النينجا الرابعة، من استطاع أن يوقف تقنية الايدوتنسي؟", 
  
 "ما هو أطول قتال في عالم الأنمي؟", 
  
 "ما هو اسم عملاق إيرين؟", 
  
 "كم عدد المذكرات التي ظهرت في أنمي ديث نوت؟", 
  
 "كم عدد أعضاء الأكاتسكي؟", 
  
 "في أي عام تم اختراق سور ماريا؟", 
  
 "ما اسم مدرب فريق كيبا و شينو و هيناتا؟", 

"هل ون بيس فيه اكثر من 1000 حلقة؟",
   
"ما هو اسم اب ناروتو؟",
  
"ما هو اسم ام ناروتو؟",
   
"ما اسم مدرب فريق كيبا و شينو و هيناتا؟",
  
"كم عدد الاقمار العليا؟",
   
"من قتل رينغوكو؟", 
  
"دوما ام اكازا؟",
   
"من الذي يلقب بالحمامة؟",
  
"كم فرد على قيد الحياة من الاوتشيها؟",
   
"ما اسماء أبناء ناروتو؟",
  
"كم فرد يوجد في الفريق السابع في ناروتو؟",
   
"من هو الهوكاجي السابع في ناروتو؟", 
     
"ما الذي يطلق على الطاقة في هنتر؟",
  
"كم سيف عند زورو؟",
   
"ما اسم لوفي الكامل؟",
  
"كم أكرمان ما زال على قيد الحياة؟",
   
"ما السبب في قتل جميع أعضاء الأكرمان؟", 
  
"كم نينجا شارك شارك في حرب النينجا العظمى؟",
   
"ريوك في اي انمي ظهر؟",
  
"ما اسم زوجة ناروتو؟",
   
"ما اسم بطل ون بيس؟",
  
"كم عضو في طاقم قبعة القش؟",
   
"اين ولد أستا؟", 
   
"ما الذي يدعون ناروتو بيه؟",
  
"ما اسم فرقة استا؟",
   
"من نائب يامي؟", 
     
"من السبب لتحول كانيكي الى نصف غول؟",
  
"ما اسم زوجة كانيكي؟",
   
"ما اسم روبين الكامل؟",
  
"ما هو منصب اكاينو؟",
   
"ما اسم القمر العلوي الأول؟", 
  
"ما اسم زعيم الشياطين؟",
   
"ما اسم قائد تومان؟",
  
"من هو نائب تاكيميتشي؟",
   
"من هو نائب سانو مانجيرو؟",
  
"من أسس تومان؟",
   
"ما اسم المقر الذي يجلس فيه كانيكي؟", 
  
"من هو نائب لوفي؟",
  
"من اليد اليسرى للوفي؟",
   
"كم يونكو ظهر في الانمي؟", 
     
"ما عدد الخطايا السبعة؟",
  
"من هو القمر العلوي التالت؟",
   
"كم شيطان علوي واجه تانجيرو في الانمي؟",
  
"ا اسم قاتل القمر العلوي الخامس؟",
   
"ما اسم والد ايرين؟", 
  
"كم سور موجود في جزيرة باراديس؟",
   
"ما اسم كلب دنيجي الصغير؟",
  
"كم باع دينجي عينه اليمنى؟",
   
"ما هو أول شيطان قتل على يد دينجي في بداية الانمي؟",
  
"أي جزء من جسد بوتشيتا بقي مرئيا على جسد دينجي بعد ان اعطاه قلبه؟",
   
"كيف توفيت والدة دينجي؟", 
   
"ما هو العضو الذي لم يقم دينجي ببيعه لسداد ديونه؟",
  
"من هو شقيق نيزوكو؟",
   
"كم عدد اخوة نيزوكو؟", 
     
"لماذا الانمي الرومنسي يكون دائما كوميدي؟",
  
"ما هو نوع الانمي المفضل لديك؟",
   
"هل يضايقك كون ان اغلب شخصيات الانمي لا تغير ملابسها؟",
  
"هل تحب قصص الانمي التراجيدية (الماساوية)؟",
   
"ماذا تفضل ان يكون بطل الانمي (فتى ام فتاة)؟", 
  
"الانمي الذي تحبه حبا جما هل هو مشهور؟",
   
"اغلبنا يفضل مشاهدة الانمي الاصلي فلماذا؟",
  
"جميعنا يعلم ان الانمي لا تكاد تخلو منه لقطات مخلة . فهل تشاهد مثل هذه الانميات؟",
   
"هل شعرت يوما بانك تكره الانمي لانه يوجد به اشياء مخلة؟",
  
"بنظرك ما هي نقاط ضعف الانمي؟",
   
"هل تحب ان تكون قصص الانمي طويلة؟", 
  
"الانمي امتعك كثيرا و لكن هل افادك ؟ و بماذا؟", 
  
"عندما تكبر وتتزوج هل ستترك الانمي ؟ خصوصا اذا كان شريك حياتك لا يحبه؟",
  
"هل تحب ان يكون بطل الانمي في نفس المرحلة العمرية التي انت فيها؟",
   
"هل انت من محبي الانمي الرومانسي؟", 
     
"كم يبلغ طول سور روز؟",
  
"كم بعد المسافة بين سور روز وسور ماريا؟",
   
"لماذا لم يعد الأشخاص الثلاثة الذين كانوا يلحقون إيزابيل؟",
  
"في أي حلقة من الموسم الرابع ماتت ساشا؟",
   
"في أي حلقة قطعت يد إيروين؟", 
  
"ما معنى اسم عائلة اكرمان؟",
   
"ما هو طعام ساشا المفضل؟",
  
"من القائد بعد هانجي؟",
   
"ما هو حلم ايروين؟",
  
"من الفتاة التي تعرف سر الأسوار؟",
   
"ما اسم أصدقاء ليفاي؟", 
   
"ما اسم الشخص الذي أعطى العملاق المهاجم لغريشا؟",
  
"ما هو لقب جان؟",
   
"كم يبلغ طول ليفاي؟", 
   
"كم عملاقًا يملك ايرين في الموسم الرابع؟",
   
"كيومي أزومابيتو سفير أي أمة؟",
  
"ما الذي يستخدمه إرين لإغلاق وردة الحائط بعد خرقها؟",
   
"في الأساطير الدانية ، من منح يمير فريتز قوة الجبابرة؟", 
  
"حدد 4 جبابرة حقيقيين",
   
"بينما في شكل تيتان نقي ، من يأكل بيرتهولدت هوفر؟",
  
"غريشا ييغر سرقت العملاق المؤسس من أي عائلة قبل أن تقضي عليهم تقريبًا؟",
   
"مع من يتعاون ليفي لإنقاذ إرين من أنثى تيتان؟",
  
"ما هي الطريقة التي تحول رعايا يمير إلى جبابرة؟",
   
"3 جدران سُميت على اسم بنات الملك؟", 
  
"ما علاقة كيني السفاح بليفي أكرمان؟", 
  
"يسمح The Founding Titan لمستخدمه بالتحكم في جبابرة آخرين بفعل ماذا؟",
  
"من كان جان كيرشتاين متنكرا عندما تم نقله إلى العاصمة الإمبراطورية للحكم عليه؟",
   
"ماذا وجد ليفاي في القاع الكاذب لمكتب إيرين في الطابق السفلي؟", 
     
"كيف تسبب إيرين بطريق الخطأ في تحوله في تيتان؟",
  
"كيف اقتحم هجوم العمالقة الدرع البلوري لمطرقة الحرب؟",
   
"في قرية راجاكو المدمرة ، وجدت كوني سبرينغر تيتان ملقاة أين؟",
  
"ما هي المدة التي يعيشها شخص ما بعد أن يأكل شخصًا يتحكم في أحد الجبابرة التسعة؟",
   
"كيني أكرمان قتل ديمو ريفز بينما كان يفعل ماذا؟", 
  
"ما هي آخر هدية قدمها كيني أكرمان إلى ليفاي؟",
   
"ما لون الإشارات الضوئية التي استخدمها فوج الكشافة للتحذير من اقتراب جبابرة؟",
  
"من كان السّبب وراء ندبة لوفي تحت عينه اليُسرى؟",
   
"كم كان عمر غول دي روجر عندما توفّى؟",
  
"صح أم خطأ: يمكن للجميع تعلّم الهاكي، بينما لا يمكن لأحد أن يأكل فاكهتين شيطان.",
   
"ما هي وظيفة سانجي على السّفينة؟", 
   
"ما اسم الفاكهة الّتي تناولها مونكي دي لوفي؟",
  
"فاكهة الموكو موكو نو مي تمكّن آكلها من؟",
   
"من أعطى مونكي دي لوفي قبّعة القشّ الخاصّة به؟",
  
"ما الوعد الّذي قطعه زورو لـ لوفي بعدما خسر أمام عين الصّقر ميهوك؟",
   
"كم كانت أول مكافأة على رأس لوفي؟",
  
"مَن هو أول شخص هزم زورو؟",
   
"لماذا بكى لوفي بشأن مكافأته؟", 
  
"ما الوعد الذي قطعه لوفي لشانكس؟",
   
"أول فصل من آرك المارين فورد",
  
"أول مستخدم فاكهة زون ظهر بالقصة",
   
"أول عدو للوفي",
  
"أول أدميرال يقابلوه طاقم قبعة القش",
   
"اسم سفينة إينيل", 

"قتال بين شخصيتين استمر 5 ايام",
   
"متى صدرت مانجا ون بيس",
  
"أول شخص استطاع الهروب من سجن الإمبل داون",
   
"أول تشيبوكاي ظهر في القصة", 

"كم عمر فرانكي قبل السنتين",
   
"اسم فاكهة ماجيلان",
  
"من قائل مقولة إن لم تكن مستعدًا للموت لا تأتي لهذه البحار؟",
   
"كم عمر تشوبر؟", 

"كم تبلغ مكافأة لوفي؟",
   
"كم عمر ايس عندما خرج للبحر؟",
  
"من هو أول شخص هزمه لوفي (تشيبوكاي)",
   
"ما اسم مربيه نامي", 
  
 " من وقتك تصلي ع الرسول صلي الله عليه وسلم 💫", 
  
 "دقيقه من وقتك تدعو لامواتنا واموات المسلمين بالرحمة 🤲🏻", 
  
 "من قتل هانجي؟", 

 "في اي موسم مات الدانشو ايروين؟", 
   
 ] 
