let handler = async (m, { command, text }) => m.reply(`*「 🚫┋قـــوانــيــــن ╰『𝐃𝐚𝐫𝐤 ♠️』┋📋」*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*「 ❗┋أشـــيـــاء  تــؤدي الــي إنــــذار ┋ ❗」*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*『1』 افـتـعـال مـشـاكـل*
*『2』 الـتـحـدث فـي الـسـيـاسـه أو الـديـانـات*
*『3』الاعـتـراض عـلـي قـرار الـمـشرفـيـن*
*『4』 طـلـب الاشـراف*
*『5』الـتـحـدث بـلـهـجـات غـيـر مـفـهـومـه*
*『6』اسـبـام 5 صـور أو مـلـصـقـات*
*『7』يـمـنـع الـحـرق سـواء مـن مـانـجـا أو انـمـي*
*『8』طـلـب ".الاوامـر" مـن الـبـوت فـي الـشـات*
*『9』الـمـبـالـغـة بـاسـتـخـدام الـبـوت*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*「 ❗┋أشـــيـــاء  تــؤدي الــي إنــــذاريــــن ┋ ❗」*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*『1』السـب*
*『2』 تـخـريـب الأسـألـه والـنـقـاشـات.... بـأي شـكـل كـان*
*『3』 الاهـانـه لأي مـشـرف أو عـضـو*
*『4』 اخـذ دور الـمـشـرف*
*『5』 الاعـتـراض عـلـى الانـذار  بـالـعـام*
*『6』 عـدم الاسـتـجـابـة لامـر مـشـرف او اداري*
*『7』 ارسـال شـئ غـيـر لائـق*
*『8』الـتـشـفـيـر{كـتـابـه،ايـمـوجـيـات،مـلـصـق،الـخ..}*
*『9』 ارسـال روابـط*
*『10』الـحـديـث عـن نـقـابـات اخـري*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*「 ⏳┋ أشـــيـــاء  تــؤدي الــي طــرد  الــمــؤقـــت ┋ ⏳」*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*『1』الـمـبـالـغـه فـي اسـتـفـزاز عـضـو او مـشـرف*
*『2』تـخـريـب الـفـعـالـيـات عـمـدا*
*『3』ارسـال مـقـاطـع أو صـور فـيـديـو غـيـر لائـقـه*
*『4』ارسـال صـور لـجـسـمـك حـتـي لـو بـطـلـب أحـد مـن الاعـضـاء*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*「 ⛓️┋ أشـــيـــاء  تــؤدي الــي الــطـرد الــمــؤبــد ┋⛓️」*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*『1』تـهـديـد الاعـضـاء او الـمـشـرفـيـن*
*『2』مـخـالـفـة الـقـوانـيـن عـمـدا*
*『3』الـتحـرش بـكـافـة انـواعـه*
*『4』انـتـحـال لـقـب غـيـرك عـمـدا*
*『5』الـتـسـبـب فـي خـروج عـضـو*
*『6』الـدخـول لأي بـنـت فـي الـخـاص*
*『7』 إرسـال أي صـوره او مـمـاثـلـهـا مـن انـمـي هـيـنـتـاي او ايـتـشـي*
*『8』 الـعـنـصـريـه والـتـنـمـر الـمـتـعـمـد {عـمـره،دولـتـه،لـهـجـتـه،الـخ..}*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*⧉┇『مـلاحـظـہہ☀️ ┇‼️』↶*

*〄┇الإعـتـراض عـلـى الإنـذار يـكـون فـي الـخـاص فـقـط*
*〄┇يـحـق لـلـمـشـرف تـطـبـيـق عـقـوبة غـيـر مـوجـوده*
*◄┇ 3 انـذارات = طـرد مـؤقـت*
*◄┇ الـطـرد الأول 3 ايـام*
*◄┇وكـل مـره تـتـكـرر ، تـتـدبـل مـدة الـطـرد*
*◄┇3 مـؤقـت=مـؤبـد*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*┇"عـمـلـه الـنـقـابـة هـي الـبـيـلـي"┇*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
*┇الـمـؤسـسـيـن↫〘مـيـسـي ،ايـتـاشـي〙*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*
✾تــ✍︎ــوقــيــع ↯:*
*『𝐃𝐚𝐫𝐤 ♠️』*
*❂━━━ • ━━━╏♠️╏━━━ • ━━━❂*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(القوانين|قانون|law|قوانين)$/i

export default handler
