let handler = async (m, { conn, command, text }) => {
let love = `
*〄━━┋ ★الـأوامــر شرح★ ┋━━〄*

*❁ اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَامُحَمد ﷺ ❁*

*˼‏🕌˹ قـسـم الـدين╿↶*
━ ── • ⟐ • ── ━
❖↫اذكار الصباح 
↫ يجيبلك اذكار الصباح 

❖↫اذكار المساء 
↫ يجيبلك اذكار المساء

❖↫.صوت1 
↫يجيبلك قران بدون مايك ( 1 : 7 ) اصوات

*˼‏📥˹ قـسـم التحميل╿↶*
━ ── • ⟐ • ── ━

❖↫.بحث
↫البوت يبحث عن ما تشاء في اليوتيوب

❖↫.شغل
↫يحمل صوت من اليوتيوب 

❖↫.فيديو
↫يحمل فيديو من اليوتيوب 

❖↫.انستا
↫يحمل فيديو من الانستغرام

❖↫.تيك
↫البوت يحمل من التيك توك 

❖↫.بلاي
↫البوتي يحمل برنامج او العاب من متجر بلاي

❖↫.صوره
↫البوت يحمل ما تبحث عنه من جوجل صور

*˼‏🔃˹ قـسـم التحويلات╿↶*
━ ── • ⟐ • ── ━

❖↫.كود
↫البوت يصنع باركود 

❖↫.ملصق
↫تحويل الصوره لملصق - استيكر

❖↫.سرقه
↫سرقه الملصق وتخليه بحقوقك

❖↫.دمج
↫دمج الايموجي وتكوين استيكر 

❖↫.لصوره
↫تحويل الملصق لصوره

❖↫.لكرتون 
↫يحول صورك لكرتون مع تحويل الوجه لاستيكر 

❖↫.لانمي
↫تحويل صورك لانمي بالذكاء الاصطناعي

❖↫.لفديو
↫تحويل الملصق المتحرك لفديو 

❖↫.تليجراف
↫رفع الصور والفديوهات الى تليجراف

❖↫.فريبيك
↫ الحصول علي الصور من موقع فري بيك 

❖↫.اتتب
↫الحصول علي ملصق  بالكلمات

❖↫.الحب 
↫ يقيس لك نسبه حب صديقتك ف الجروب

*˼‏💠˹ قـسـم الـمـجـمـوعـات╿↶*
━ ── • ⟐ • ── ━

❖↫.لو 
↫ لعبه لو خيروك للتسلية مع الاصدقاء 

❖↫.توب
↫يجيبلك افضل عشره ف الجروب

❖↫.المشرفين 
↫يجيبلك قايمة المشرفين 

❖↫.الجروب 
↫ يجيبلك معلومات الجروب كامله

❖↫.مخفي
↫منشن وهمي

❖↫.منشن
↫يمنشن جماعي لكل الاعضاء 

❖↫.الاشباح 
↫يجيبلك الاعضاء الى مابتتفاعلش 

❖↫.لينك
↫يجيبلك لينك الجروب

❖↫.رستر
↫يرستر او يعمل اعاده تعين للينك الجروب

❖↫.رفع
↫رفع عضو لمشرف

❖↫.خفض
↫خفض مشرف لعضو

❖↫.استماره
↫البوت يعطيك استماره للنقابه

*˼‏🖼️˹ قـسـم الـصـور والايـدت╿↶*
━ ── • ⟐ • ── ━

❖↫.خلفيه
↫يرسل خلفيات انمي

❖↫.ميمز
↫يرسل ميمز انمي

❖↫.طقم
↫يجيبلك طقم ولاد و بنات

❖↫.طقم2
↫يجيبلك صور اولاد

❖↫.طقمي
↫يجيبلك طقم بنات

❖↫.كلب
↫صور كلبب عشوائية

❖↫.قط
↫صور لقطط عشوائية

❖↫.ايدت
↫البوت يرسل ايدت انمي

❖↫.جوده
↫البوت يوضح لك الصورهhd

*˼‏👥˹ قـسـم الاعـضــاء╿↶*
━ ── • ⟐ • ── ━

❖↫.بروفايل
↫البوت يجلب لك معلوماتك 

❖↫.المطور
↫يجلب لك رقم المطور 

❖↫.الدعم
↫يجلب لك ڪروب المطور👑

❖↫.انطق
↫تحويل النص الى كلام 

❖↫.صوره
↫الحصول علي صوره من جوجل 

❖↫.الخصوصيه
↫يوضح لك السياسه والخصوصيه التي وضعها المطور

❖↫.تصميم 
↫الحصول علي تصميم من البوت 

❖↫.اقتباس 
↫الحصول علي اقتباسات انجليزيه مع ذكر المؤلف



*˼‏🖥️˹ قـسـم المطور╿↶*
━ ── • ⟐ • ── ━

❖↫.بريم
↫ يمكن للمطور فقط اعطاء صلاحيات لاستخدام البوت 

❖↫.حظر 
↫حظر الشات للبوت 

❖↫.الغاء-الحظر 
↫الغاء حظر الشات للبوت 

❖↫.المحظورين 
↫يجيبلك الارقام والشاتات المحظوره

❖↫.المميزين 
↫الاشخاص البريميوم

❖↫.البلوكات 
↫الاشخاص الي واخدين بلوك من البوت 

❖↫.بان 
↫حظر شخص من استخدام البوت

❖↫.بلوك
↫تخلي البوت يعمل لشخص بلوك

❖↫.رفع-البلوك
↫ البوت يشيل البلوك

❖↫.انضم
↫البوت ينضم لجروبات عن طريق الرابط

❖↫.اخرج
↫البوت يخرج من الجروبات 

*˼‏🪂˹ قـسـم الـتـرفـيـه╿↶*
━ ── • ⟐ • ── ━

❖↫.بوت
↫البوت يتكلم معك بذكاء الصناعي

❖↫.صوت-انمي١ 
↫ يجيبلك اصوات انمي ( 1 : 7 ) اصوات

❖↫.تحدث 
↫ التحدث او استخدام الشات جي بي تي 

❖↫.سؤال 
↫ اسئلة عشوائيه للتسلية مع الاصدقاء 

❖↫.زخرفه
↫زخرفه الكلمات للاسف الانجليزي بس 

❖↫.ايه 
↫ ايه الكرسي 

❖↫يوجد امر واحد فقط بالانجليزي وهو .logo 
↫لصناعه لوجوهات باحترافيه 

*˼‏˹ قـسـم الـبـنـك💸╿↶*
━ ── • ⟐ • ── ━

❖↫.البنك 
↫ يجيبلك حساب نقات فعاليات البوت

❖↫.شراء 
↫ اذا اردت شراء لماس واكتب الكميه مثال شراء 1

❖↫.يومي 
↫ ايه يعطيك هديه يوميه

❖↫.لفل 
↫ يجيبلك نقاتك وعدد الماسك ورتبتك

❖↫.تحويل 
↫ لتحويل نقاتك الي شخص اخر

❖↫.تصنیف 
↫ ايه يجيب اكثر اشخاص ربحو نقاط من البوت

━ ── • ⟐ • ── ━
*˼‏ ⚠️˹ مـلاحــظــة╿↶*
╭ ⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╮
*❶ - يمنع منعا بتا سب البوت.*
*❷ - استخدام البوت بشكل متوازن و بدون تسبب ازعاج للاعضاء.*
 ╰⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╯

*~.¸¸ ❝ 𝓤𝓵𝓺𝓾𝓲𝓸𝓻𝓻𝓪 𝓑𝓸𝓽 𝐼❝ ¸¸.~* `.trim()
m.reply(love, null, { mentions: conn.parseMention(love) })}
handler.help = ['love']
handler.tags = ['fun']
handler.command = /^(شرح|الشرح)$/i
export default handler